tests/cases/crystallizationAdvection/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
scale   1;

vertices
(
    (0    0     0)
    (0.02 0     0)
    (0.02 0.002 0)
    (0    0.002 0)
    (0    0     0.002)
    (0.02 0     0.002)
    (0.02 0.002 0.002)
    (0    0.002 0.002)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 4 1) simpleGrading (1 1 1)
);

defaultPatch
{
    type empty;
}

boundary
(
    inlet
    {
        type patch;
        faces ((0 3 7 4));
    }

    vent
    {
        type patch;
        faces ((1 2 6 5));
    }

    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
        );
    }
);
