tests/cases/crystallizationAdvection/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    inlet
    {
        type            moldingInletVelocity;
        volumetricFlowRate 1e-07;
        value           uniform (0 0 0);
    }
    vent    { type moldingVentVelocity; value uniform (0 0 0); }
    walls   { type noSlip; }
}
