tests/cases/crystallizationAdvection/system/expectedPatterns
moldingFoam: crystallinity: max\(chi\)
End
