tests/cases/crystallizationAdvection/system/verifyScript
verify-crystallization-advection.py
